{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "dtype": "float32", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.3, "name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_5", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_6", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.4, "name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "activation": "softmax", "units": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}